## Staging: export 💾
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                              NAME                                                               |
|--------|---------------------------------------------------------------------------------------------------------------------------------|
| update | `module.platform_gc_design_system_export.aws_ssm_parameter.airtable_api_key`                                                    |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_policy.policies[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform_gc_design_system_export.data.aws_iam_policy_document.platform_gc_design_system_export will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "platform_gc_design_system_export" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:454671348950:parameter/platform/gc-design-system/airtable-api-key",
            ]
          + sid       = "GetSSMParameters"
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-raw-staging/platform/gc-design-system/airtable/*",
              + "arn:aws:s3:::cds-data-lake-transformed-staging/platform/gc-design-system/airtable/*",
            ]
          + sid       = "WriteToS3Bucket"
        }
      + statement {
          + actions   = [
              + "glue:GetCrawler",
              + "glue:StartCrawler",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:glue:ca-central-1:454671348950:crawler/Platform / GC Design System / Airtable",
            ]
          + sid       = "StartGlueCrawler"
        }
    }

  # module.platform_gc_design_system_export.aws_ssm_parameter.airtable_api_key will be updated in-place
  ~ resource "aws_ssm_parameter" "airtable_api_key" {
        id              = "/platform/gc-design-system/airtable-api-key"
        name            = "/platform/gc-design-system/airtable-api-key"
        tags            = {}
      ~ version         = 1 -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id               = "arn:aws:iam::454671348950:policy/platform-gc-design-system-airtable-export-0"
        name             = "platform-gc-design-system-airtable-export-0"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ssm:GetParameter*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:454671348950:parameter/platform/gc-design-system/airtable-api-key"
                      - Sid      = "GetSSMParameters"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-data-lake-transformed-staging/platform/gc-design-system/airtable/*",
                          - "arn:aws:s3:::cds-data-lake-raw-staging/platform/gc-design-system/airtable/*",
                        ]
                      - Sid      = "WriteToS3Bucket"
                    },
                  - {
                      - Action   = [
                          - "glue:StartCrawler",
                          - "glue:GetCrawler",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:glue:ca-central-1:454671348950:crawler/Platform / GC Design System / Airtable"
                      - Sid      = "StartGlueCrawler"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "PlatformDataLake"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_ssm_parameter.airtable_api_key"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_policy.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_role.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_kms_key.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
